{
  "fullName": "Sommer Dandrade, PMP®, PMI-RMP®, PMI-ACP® (She/Her)",
  "headline": "Enterprise Program & Project Manager | Risk & Data-Driven Strategist | Security & Quality-Focused Leader | Process Optimizer | Efficiency Advocate | Dedicated Mentor | Exploring New Challenges & Opportunities",
  "location": "Hampton Roads, Virginia Metropolitan Area",
  "profileUrl": "https://www.linkedin.com/in/sommerjdandrade",
  "photoUrl": "",
  "about": "I’m a strategic program and project leader passionate about AI-powered solutions that fuel innovation, streamline operations, and deliver measurable customer value. With a strong bias for execution and deep expertise in cross-functional delivery, I help enterprises accelerate transformation, strengthen governance, and elevate performance, especially in complex, regulated environments.\n\nWith over a decade of experience, I have successfully led multimillion-dollar initiatives across AI/ML data services, ERP and SaaS implementation, human capital strategy, and large-scale infrastructure development. My leadership covers all phases of program and project execution—from vision to velocity. Whether launching a $60M urban development initiative, overseeing AI/LLM annotation programs, or architecting a Project Management Academy, I consistently deliver scalable, high-impact results.\n\nMy Areas of Expertise and Specialization include:\nEnterprise Program & Project Leadership | AI/ML Support | LLM Supervised Fine-Tuning Support | Agile & Risk Management | Scalable PM Frameworks | SaaS/ERP Implementation | Strategic Change Enablement | Organizational Strategy | OKRs & KPI Governance | Executive Stakeholder/Client Engagement | PM Academy Design & Delivery | Logistics | Quality Control/Assurance | Urban Infrastructure Delivery | ClickUp | Microsoft Project\n\nSelected Achievements:\n\nLiberty Source: Led 30+ digital transformation projects, improving project tracking accuracy by 85%, reducing delivery timelines by 60%, and enabling faster executive decision-making through enhanced reporting visibility. Supported a successful change management initiative and increased project delivery throughput by 70%.\n\nEastman & Associates: Managed HR transformation engagements, including a $600K workforce optimization project that increased regulatory compliance by 80%, improved employee retention by 75%, and boosted HR process efficiency by 70%.\n\nRegency Group: Delivered $60M+ in urban and agrarian infrastructure projects, reducing time-to-completion by 70% and achieving 100% regulatory compliance—securing multi-phase government approvals and sustained development funding.\n\nI thrive at the intersection of strategy and structure, leading with clarity, building high-performing global teams, and championing continuous improvement—ensuring delivery aligns innovation with compliance, performance, and stakeholder trust.\n\n📧 sommerjdandrade@gmail.com – Let’s connect if you seek a transformative leader to shape and scale your next program, project, or AI-driven enterprise initiative.",
  "designation": "Project Manager",
  "positions": [
    {
      "title": "Project Manager",
      "company": "Liberty Source PBC",
      "location": "United States",
      "startDate": "Feb 2023",
      "endDate": null,
      "description": "Liberty Source is a US-based corporation specializing in human-in-the-loop data services that enable organizations to maximize returns on their AI, ML, and BI investments. By offering fully onshore operations, Liberty Source ensures high levels of data security, seamless real-time collaboration, and accurate cultural interpretation—critical for sensitive and complex data initiatives.\n\nOur comprehensive service offerings include image annotation, data labeling, computer vision calibration, natural language processing (NLP) validation, training data curation, and a range of customized data optimization solutions. These capabilities support the development of high-quality, trustworthy AI models and accelerate enterprise transformation.\n\nWhat sets Liberty Source apart is our strong commitment to social impact. As a Public Benefit Corporation, we focus on recruiting veterans and military spouses—professionals known for their discipline, adaptability, and mission-focused mindset. Their contributions consistently drive operational excellence and data integrity for our clients.\n\nKey Achievements:\n\nProject Management Academy: Spearheaded the design and successful launch of Liberty Source’s internal Project Management Academy, aimed at developing leadership skills, standardizing delivery practices, and building a scalable project management culture. This initiative led to an 80% increase in project throughput and a measurable rise in delivery quality and consistency.\n\nERP and SaaS Implementation: Successfully led the implementation of enterprise-level ERP and SaaS projects, improving system efficiency, data visibility, and cross-functional alignment—laying the foundation for sustainable digital operations.\n\nThese accomplishments reflect Liberty Source’s broader mission to deliver high-impact, secure, and socially conscious data solutions that align innovation with execution.\n\nOpen to new opportunities | Recently impacted by company-wide layoffs at Liberty Source."
    },
    {
      "title": "Project Management Specialist",
      "company": "Eastman and Associates Limited",
      "location": "Trinidad and Tobago",
      "startDate": "Jan 2022",
      "endDate": "Feb 2023",
      "description": "Eastman & Associates Limited is a trusted Human Resource consulting firm based in Trinidad & Tobago, proudly serving clients since 1983. With over 40 years of success, we specialize in executive and administrative recruitment, HR strategy consulting, and organizational development for both local and international businesses.\n\nOur client portfolio includes leading organizations such as Caribbean Airlines, BG, and Trinidad Tourism Limited. Backed by a team of Trinidad’s most qualified HR consultants, we deliver tailored, high-impact solutions across the HR lifecycle—from strategic sourcing and behavioral interviewing to compensation planning, policy development, and compliance alignment.\n\nEastman & Associates is committed to helping organizations build high-performing, values-aligned teams. Our approach emphasizes rigorous assessment across experience, competence, and character—positioning us as a trusted partner in workforce transformation and long-term HR success.\n\nKey Achievements:\nAs Project Management Specialist (Jan 2022 – Feb 2023), I led several HR transformation projects across diverse sectors:\n\nDirected full lifecycle execution of HR initiatives including recruitment infrastructure, performance systems, and compensation modeling.\n\nDesigned and secured executive approval for five customized HR project proposals aligned with each client’s culture and strategic goals.\n\nDelivered a $600K engagement that transformed a manufacturing firm’s HR function—resulting in an 80% increase in regulatory compliance and a 75% improvement in employee retention.\n\nAuthored tailored employee handbooks and organizational policies that enhanced operational continuity and ensured compliance.\n\nAchieved 100% client satisfaction through structured delivery, transparent communication, and strategic engagement.\n\n📍 Learn more at www.eaasltd.com."
    },
    {
      "title": "Project Officer/Human Resource Officer/Property Administrator",
      "company": "Regency Group of Companies",
      "location": "",
      "startDate": "Mar 2013",
      "endDate": "Dec 2020",
      "description": "Regency Group is a multidisciplinary consulting firm based in Trinidad & Tobago, offering integrated services in land development, property and asset management, operations, and project management. Through its property management arm, Regency Homes Limited, the Group delivers strategic value to both public and private sector clients via customized infrastructure and operational solutions.\n\nWith decades of experience leading complex initiatives, Regency Group is known for its end-to-end project execution—from concept and design to completion and compliance. Our consultancy model blends deep industry expertise with a practical understanding of regulatory frameworks, stakeholder engagement, and funding structures to drive sustainable development.\n\nSpecializing in both urban and agrarian infrastructure, Regency Group prioritizes measurable outcomes, budget discipline, and seamless delivery. The firm is trusted for its ability to manage large-scale projects while aligning technical execution with community needs and long-term growth strategies.\n\nKey Achievements:\nAs Project Manager and Operations Manager (Mar 2013 – Dec 2020), I delivered high-impact results across Regency’s project and property management portfolio:\n\nLed operational strategy across six subsidiaries, aligning KPIs with business goals to enhance profitability and service quality.\n\nDelivered urban housing and agrarian projects valued at over $60M, with 100% on-time and on-budget outcomes.\n\nOversaw full project lifecycles, including design, procurement, execution, and compliance reporting.\n\nCultivated key relationships with government agencies, securing multi-phase approvals and sustainable funding.\n\nImplemented process improvements that increased throughput and reduced overhead.\n\nAuthored funding proposals and strategic documents supporting multi-year development and growth initiatives."
    },
    {
      "title": "Director",
      "company": "Tinymite Entertainment Ltd",
      "location": "",
      "startDate": "Jun 2007",
      "endDate": "Sep 2015",
      "description": "Tiny Mite Entertainment is a dynamic event management company specializing in delivering premium, tailor-made events across the Caribbean region. As Director, I contributed significantly to shaping the Group’s strategic framework, enhancing service offerings, and expanding market reach. Our focus on creativity, flawless execution, and client satisfaction has positioned Tiny Mite Entertainment as a trusted leader in the Caribbean’s event management landscape.\n\nKey Achievements:\n\nDeveloped and implemented strategic initiatives that expanded the company’s service portfolio and regional footprint.\n\nLed cross-functional teams to successfully plan and execute high-profile events with consistent positive client feedback.\n\nEnhanced operational workflows, resulting in improved project delivery timelines and cost efficiencies.\n\nCultivated strong client relationships across the Caribbean, driving repeat business and referrals.\n\nContributed to revenue growth through targeted business development and innovative event solutions."
    },
    {
      "title": "HR Assistant (Appointments)",
      "company": "University of the West Indies, St. Augustine Campus",
      "location": "",
      "startDate": "Jun 2012",
      "endDate": "Mar 2013",
      "description": "The University of the West Indies (UWI) is the Caribbean’s leading tertiary institution, renowned for academic excellence and regional leadership. As HR Assistant for the Faculty of Humanities and Education, I led and supported human resource operations across five departments, ensuring the seamless execution of faculty staffing processes and academic lifecycle management.\n\nThis role involved driving several HR process improvement initiatives while overseeing daily operational tasks, including:\n\nDesigning and publishing job postings for academic roles in line with university protocols and departmental needs.\n\nManaging recruitment advertising and serving as point-of-contact for internal and external stakeholders throughout hiring campaigns.\n\nDrafting, reviewing, and issuing employment contracts for new hires, contract renewals, adjunct staff, and visiting academics.\n\nAdministering staff leave, travel/study grant correspondence, and entitlements for academic personnel.\n\nCoordinating directly with department heads, central HR, and faculty administrators to resolve employee matters efficiently and compliantly.\n\nKey Project Achievement:\nLed the design and rollout of a faculty-wide HR process improvement initiative focused on streamlining contract management and academic benefits administration. This included the standardization of contract templates, introduction of a centralized tracking system for leave and grant requests, and creation of a faculty-specific HR process guide. These changes reduced administrative turnaround times by 30%, improved policy adherence, and strengthened stakeholder satisfaction across departments.\n\nThis role blended daily operational HR execution with continuous improvement efforts—supporting academic excellence through optimized people processes and service delivery."
    }
  ],
  "educations": [
    {
      "school": "The University of Salford",
      "degree": "MSc Project Management",
      "field": "Project Management",
      "startDate": "",
      "endDate": ""
    },
    {
      "school": "University of the West Indies, St. Augustine Campus",
      "degree": "Bachelor of Science (BSc.)",
      "field": "Psychology with minors in Human Resource Management and Gender Studies",
      "startDate": "",
      "endDate": ""
    }
  ],
  "services": [],
  "skills": [
    "Dashboards",
    "Partner Relationship Management",
    "Project Manager at Liberty Source PBC",
    "Endorsed by 1 person in the last 6 months",
    "3 endorsements"
  ],
  "certifications": [
    "Google AI Essentials V1",
    "Ethics in the Age of Generative AI"
  ],
  "websites": [
    "https://lnkd.in/dRym7tG",
    "https://www.goldbelt.com/careers/",
    "https://www.credly.com/badges/ff5f3c7a-90c1-432a-a595-03056e548b8a/linked_in_profile"
  ],
  "patents": [],
  "recommendations": {
    "received": [
      {
        "name": "Mihai Rotaru",
        "headline": "IT Risk Technical SME at Freddie Mac",
        "dateLine": "April 16, 2025, Mihai worked with Sommer on the same team",
        "text": "It's been a pleasure working alongside Sommer over the past two years, and I'm proud to recommend her for her outstanding project management expertise. Although new to the industry, Sommer quickly absorbed IT and data concepts, ERP systems, and system dependencies - approaching each with curiosity, confidence, and a drive to learn. These skills only deepened as she immersed herself in increasingly technical projects.\nSommer brings a thoughtful and thorough approach to every initiative, ensuring that both internal and client-facing requirements are clearly understood and communicated. Her strong focus on IT and security considerations has been instrumental in delivering secure, compliant, and well-scoped solutions.\nWhat truly sets Sommer apart is her ability to proactively identify risks and her exceptional talent for translating complex technical details into clear, actionable insights for stakeholders. She consistently served as a vital bridge between business and project teams, adding tremendous value throughout our organization.\nI highly recommend Sommer for any project management role - particularly those requiring a strong grasp of IT dynamics, security, risk mitigation, and cross-functional collaboration.",
        "profileUrl": "https://www.linkedin.com/in/mihai-rotaru-219b11191"
      },
      {
        "name": "Denise Sweeney",
        "headline": "Professional Strategic Marketing Leader | Brand & Content Creator | Sales Operations & Data Mgt | Certified BarreFlow Instructor",
        "dateLine": "March 12, 2025, Denise worked with Sommer but on different teams",
        "text": "I had the pleasure of working closely with Sommer at Liberty Source, and I can confidently say that she is an exceptional Project Manager with over 15 years of experience in project execution, operations, and risk management across diverse industries. Her expertise in transforming strategic objectives into actionable, value-driven initiatives is truly remarkable.\n\nAt Liberty Source, Sommer oversees 30+ projects, collaborating with C-suite leaders and cross-functional teams to deliver cutting-edge AI, ML, and business intelligence solutions. Her strategic leadership ensures that project goals are aligned with business objectives, driving measurable impact and success.\n\nDuring our time together, Sommer provided invaluable assistance, guidance, and leadership in project managing the growth strategy for sales and marketing. Her ability to align project goals with business objectives was key to our success. She excels in developing project management frameworks that boost efficiency, leading large-scale projects in diverse industries, and streamlining operations to enhance productivity and revenue.\n\nWhat sets Sommer apart is her ability to proactively identify and mitigate risks, ensuring project success through exceptional risk and agile management. She excels in designing frameworks and methodologies that boost efficiency and team performance, optimizing processes to enhance overall effectiveness.\nSommer is a true team player. She is always willing to lend a helping hand, share her knowledge, and support her colleagues. Her positive attitude and work ethic are truly inspiring, and she plays a crucial role in building a cohesive and high-performing team.\n\nI highly recommend Sommer for any Project Management role she pursues. Her exceptional skills, dedication, and collaborative spirit make her an invaluable asset to any organization.",
        "profileUrl": "https://www.linkedin.com/in/denise-sweeney-23137b62"
      }
    ],
    "given": [
      {
        "name": "Denise Sweeney",
        "headline": "Professional Strategic Marketing Leader | Brand & Content Creator | Sales Operations & Data Mgt | Certified BarreFlow Instructor",
        "dateLine": "March 10, 2025, Sommer worked with Denise on the same team",
        "text": "I had the opportunity to work with Denise as her business unit project manager on several digital marketing growth campaigns for Liberty Source PBC. At Liberty Source, we enhance AI and ML systems with high-quality, human-in-the-loop data services, supporting AI initiatives across various industries.\n\nDenise combines strategic vision with hands-on execution, ensuring each campaign aligns with business objectives and delivers measurable results. She excels at crafting compelling messaging, optimizing multi-channel marketing strategies, and leveraging data-driven insights to improve performance. Denise consistently identifies growth opportunities, implements innovative solutions, and adapts strategies based on real-time analytics.\n\nHer ability to translate complex technical concepts into clear, engaging content played a key role in expanding our reach and driving audience engagement. What sets Denise apart is her collaborative approach and proactive mindset. She communicates effectively, aligns cross-functional teams, and fosters an environment where creative ideas translate into impactful outcomes.\n\nDenise’s dedication, strategic thinking, and ability to manage complex projects make her an invaluable asset to any organization. I highly recommend her for any role that requires a dynamic, results-driven marketing and communications leader.",
        "profileUrl": "https://www.linkedin.com/in/denise-sweeney-23137b62"
      },
      {
        "name": "Jeremy Rogers, MBA",
        "headline": "Vice President Finance | Strategic Finance Partner | Corp FP&A",
        "dateLine": "October 28, 2024, Sommer worked with Jeremy but on different teams",
        "text": "Working closely with Jeremy Rogers, VP of Finance at Liberty Source, I can confidently say he is an exceptional finance professional. Jeremy combines deep financial expertise, strategic vision, and collaborative leadership, creating a substantial impact across the organization.\n\nJeremy’s comprehensive knowledge of financial operations, budgeting, and forecasting has been essential in driving company growth and ensuring financial stability. He proactively identifies risks, capitalizes on opportunities, and implements strategies that align with the company’s long-term goals. His ability to navigate complex financial landscapes with a sharp focus on operational efficiency is truly impressive.\n\nWhat distinguishes Jeremy is his collaborative style and skill in partnering with cross-functional teams. Whether working with operations, HR, or business development, Jeremy fosters open communication and aligns financial strategies with organizational priorities. His empathetic leadership promotes trust and accountability, building strong relationships at all levels.\n\nJeremy is also a forward-thinking leader who prioritizes innovation and continuous improvement. He leverages technology and best practices to streamline processes, enhance reporting, and deliver insights that drive business decisions. His leadership during key initiatives, like budgeting cycles and financial audits, has been pivotal in upholding operational excellence.\n\nWorking with Jeremy has been a pleasure, and his leadership has made a lasting impact. I highly recommend Jeremy Rogers to any organization seeking a strategic, results-driven finance leader. His expertise, professionalism, and collaborative approach make him an invaluable asset to any team.",
        "profileUrl": "https://www.linkedin.com/in/jeremy-rogers-mba"
      }
    ]
  }
}